# -*- mode: org; fill-column: 78; -*-
# Time-stamp: <2025-12-21 22:29:49 krylon>
#
#+TAGS: internals(i) ui(u) bug(b) feature(f)
#+TAGS: database(d) design(e), meditation(m)
#+TAGS: optimize(o) refactor(r) cleanup(c)
#+TODO: TODO(t)  RESEARCH(r) IMPLEMENT(i) TEST(e) | DONE(d) FAILED(f) CANCELLED(c)
#+TODO: MEDITATE(m) PLANNING(p) | SUSPENDED(s)
#+PRIORITIES: A G D

* PyKuang [2/2]
  :PROPERTIES:
  :COOKIE_DATA: todo recursive
  :VISIBILITY: children
  :END:
** Clocktable
   #+BEGIN: clocktable :scope file :maxlevel 255 :emphasize t
   #+CAPTION: Clock summary at [2025-12-21 So 22:29]
   | Headline                               | Time       |            |       |      |
   |----------------------------------------+------------+------------+-------+------|
   | *Total time*                           | *1d 10:48* |            |       |      |
   |----------------------------------------+------------+------------+-------+------|
   | *PyKuang [2/2]*                        | *1d 10:48* |            |       |      |
   | \_  /Components [2/2]/                 |            | /1d 10:48/ |       |      |
   | \_    Common [1/1]                     |            |            |  0:08 |      |
   | \_      Make TTY logging configurable  |            |            |       | 0:08 |
   | \_    Model [0/0]                      |            |            |  0:25 |      |
   | \_    Database [1/1]                   |            |            |  5:42 |      |
   | \_      Add support for zone transfers |            |            |       | 3:41 |
   | \_    Cache [0/0]                      |            |            |  1:45 |      |
   | \_    Generator [0/0]                  |            |            |  4:14 |      |
   | \_    Blacklist [0/0]                  |            |            |  3:59 |      |
   | \_    XFR [0/0]                        |            |            | 17:15 |      |
   | \_    Nexus [0/0]                      |            |            |  1:20 |      |
   #+END:
** Features [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
** Components [2/2]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
*** Common [1/1]
**** DONE Make TTY logging configurable
     CLOSED: [2025-12-12 Fr 16:06]
     :LOGBOOK:
     CLOCK: [2025-12-12 Fr 15:58]--[2025-12-12 Fr 16:06] =>  0:08
     :END:
     When running the ParallelGenerator from a terminal, the output of log
     messages is overwhelming.
     I would like to either be able to turn off log output to the terminal, or
     set the minimum log level that gets emitted to the terminal.
*** Model [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-12-05 Fr 15:50]--[2025-12-05 Fr 16:15] =>  0:25
    :END:
*** Database [1/1]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-12-08 Mo 15:46]--[2025-12-08 Mo 16:31] =>  0:45
    CLOCK: [2025-12-06 Sa 15:14]--[2025-12-06 Sa 15:35] =>  0:21
    CLOCK: [2025-12-05 Fr 16:15]--[2025-12-05 Fr 17:10] =>  0:55
    :END:
**** DONE Add support for zone transfers
     CLOSED: [2025-12-13 Sa 15:20]
     :LOGBOOK:
     CLOCK: [2025-12-13 Sa 14:18]--[2025-12-13 Sa 15:20] =>  1:02
     CLOCK: [2025-12-12 Fr 17:06]--[2025-12-12 Fr 19:45] =>  2:39
     :END:
*** Cache [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-12-09 Di 15:55]--[2025-12-09 Di 16:30] =>  0:35
    CLOCK: [2025-12-05 Fr 17:15]--[2025-12-05 Fr 18:25] =>  1:10
    :END:
*** Generator [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-12-12 Fr 15:33]--[2025-12-12 Fr 15:56] =>  0:23
    CLOCK: [2025-12-11 Do 16:01]--[2025-12-11 Do 16:01] =>  0:00
    CLOCK: [2025-12-11 Do 14:30]--[2025-12-11 Do 15:57] =>  1:27
    CLOCK: [2025-12-10 Mi 14:28]--[2025-12-10 Mi 16:19] =>  1:51
    CLOCK: [2025-12-09 Di 16:31]--[2025-12-09 Di 17:04] =>  0:33
    :END:
    So now that the HostGenerator is capable of generating single Hosts, I
    want to look into parallelizing that. Which should not be hard or
    surprising. But I would like to have control over the number of generator
    threads, as I did in my last attempt in Go.
*** Blacklist [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-12-09 Di 15:40]--[2025-12-09 Di 15:51] =>  0:11
    CLOCK: [2025-12-09 Di 14:56]--[2025-12-09 Di 15:37] =>  0:41
    CLOCK: [2025-12-08 Mo 16:53]--[2025-12-08 Mo 20:00] =>  3:07
    :END:
*** Scanner [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
*** XFR [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-12-21 So 18:38]--[2025-12-21 So 22:29] =>  3:51
    CLOCK: [2025-12-20 Sa 14:02]--[2025-12-20 Sa 19:58] =>  5:56
    CLOCK: [2025-12-19 Fr 15:20]--[2025-12-19 Fr 20:38] =>  5:18
    CLOCK: [2025-12-13 Sa 15:28]--[2025-12-13 Sa 17:17] =>  1:49
    CLOCK: [2025-12-12 Fr 16:45]--[2025-12-12 Fr 17:06] =>  0:21
    :END:
*** Web Interface [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
*** Nexus [0/0]
    :LOGBOOK:
    CLOCK: [2025-12-12 Fr 15:26]--[2025-12-12 Fr 15:33] =>  0:07
    CLOCK: [2025-12-11 Do 16:09]--[2025-12-11 Do 17:22] =>  1:13
    :END:
*** Main [0/0]
** Bugs [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
